In [10]:
#Import Libraries
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as plt
import glob
import os

In [203]:
# Specify the path where your CSV files are located
csv_files = glob.glob('Data/Cars/*.csv')

# Initialize an empty list to store individual DataFrames
dfs = []

# Iterate through each CSV file and read it into a DataFrame
for file in csv_files:
    df = pd.read_csv(file)
    file = file[10:-4]
    df['Brand'] = file 
    dfs.append(df)

# Concatenate all DataFrames into a single DataFrame
combined_df = pd.concat(dfs, ignore_index=True)

In [215]:
#Create a copy of df to use
df = combined_df.copy()
df = df.drop('tax(Â£)', axis=1)

In [216]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104641 entries, 0 to 104640
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   model         104641 non-null  object
 1   year          104641 non-null  int64
 2   price         104641 non-null  int64
 3   transmission  104641 non-null  object
 4   mileage       104641 non-null  int64
 5   fuelType      104641 non-null  object
 6   tax           94327 non-null   float64
 7   mpg           99187 non-null   float64
 8   engineSize    104641 non-null  float64
 9   Brand         104641 non-null  object
dtypes: float64(3), int64(3), object(4)
memory usage: 8.0+ MB

In [217]:
df.head()

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize,Brand
0,A1,2017,12500,Manual,15735,Petrol,150.0,55.4,1.4,audi
1,A6,2016,16500,Automatic,36203,Diesel,20.0,64.2,2.0,audi
2,A1,2016,11000,Manual,29946,Petrol,30.0,55.4,1.4,audi
3,A4,2017,16800,Automatic,25952,Diesel,145.0,67.3,2.0,audi
4,A3,2019,17300,Manual,1998,Petrol,145.0,49.6,1.0,audi

In [218]:
num_rows, num_columns = df.shape
print("This dataset has ", num_rows, " rows and ", num_columns, " columns")

This dataset has  104641  rows and  10  columns

In [219]:
#Check nulls
df.isna().sum()

model               0
year                0
price               0
transmission        0
mileage             0
fuelType            0
tax             10314
mpg              5454
engineSize          0
Brand               0
dtype: int64

In [220]:
#Handling missing values
df['tax']=df['tax'].fillna(df['tax'].mean())
df['mpg']=df['mpg'].fillna(df['mpg'].mean())

In [221]:
#Check nulls
df.isna().sum()

model           0
year            0
price           0
transmission    0
mileage         0
fuelType        0
tax             0
mpg             0
engineSize      0
Brand           0
dtype: int64

In [224]:
#Initial diagnosis
df.describe().T.round(2)

,count,mean,std,min,25%,50%,75%,max
year,104641.0,2017.09,2.13,1970.0,2016.00,2017.00,2019.0,2060.0
price,104641.0,16637.34,9693.39,450.0,10000.00,14440.00,20395.0,159999.0
mileage,104641.0,23049.41,21120.06,1.0,7530.00,17360.00,32234.0,323000.0
tax,104641.0,120.26,60.20,0.0,120.26,145.00,145.0,580.0
mpg,104641.0,55.17,15.71,0.3,47.10,55.17,61.7,470.8
engineSize,104641.0,1.65,0.55,0.0,1.20,1.50,2.0,6.6